Documents/бит_УстановкаЦенРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаЦенРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ЦеныРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦеныНаРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_НормыТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/бит_УстановкаСоставаРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаСоставаРаботы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СоставРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/бит_Работы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_Работы</Name>
			<Comment>Перечень работ</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяНормаТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НормыТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЕдиницыИзмерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/бит_УстановкаЦенРабот/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , "");
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Свойство("СоздатьИзСправочникаРаботы") Тогда

		НоваяСтрока = Объект.ЦеныНаРаботы.Добавить();
		Объект.Подразделение = Параметры.СоздатьИзСправочникаРаботы.Подразделение;
		НоваяСтрока.Работа = Параметры.СоздатьИзСправочникаРаботы.Работа;
		НоваяСтрока.Норма = Параметры.СоздатьИзСправочникаРаботы.Норма;
		НоваяСтрока.ЕдиницаИзмерения = Параметры.СоздатьИзСправочникаРаботы.ЕдиницаИзмерения;
		
	КонецЕсли;	
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Вызов механизма разделения прав доступа.
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ, СтандартнаяОбработка, СправочникОбъект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовокФормыДокумента();
	
	// Установить активный реквизит.
	СтруктураРеквизитов = Новый Структура("Подразделение, Работа, ЕдиницаИзмерения, ВидОбъекта");
	
	АктивизироватьРеквизитВФормеНаСервере(СтруктураРеквизитов);
	
	// Установить доступность формы с учетом даты запрета редактирования.	
	УстановитьДоступностьФормыДляРедактированияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Если Объект.ЦеныНаРаботы.Количество() <> 0 Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПодразделениеПриИзмененииЗавершение", ЭтотОбъект), "Табличная часть документа будет очищена! Продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.ЦеныНаРаботы.Очистить();
		
	Иначе
		
		Объект.Подразделение = мКэшЗначений.мПодразделение;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мКэшЗначений.мПодразделение = Объект.Подразделение;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура ЦеныНаРаботыРаботаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЦеныНаРаботы.ТекущиеДанные;
	
	Норма			 = ТекущаяСтрока.Норма;
	ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
	
	Если ПолучитьВладельцаНормы(Норма) <> ТекущаяСтрока.Работа Тогда
		
		ТекущаяСтрока.Норма            = Неопределено;	
		ТекущаяСтрока.ЕдиницаИзмерения = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНаРаботыРаботаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		
		мКэшЗначений.мСписокРабот.Очистить();
		
		ПолучитьСписокРаботНаСервере();
		
		мСписокРабот = мКэшЗначений.мСписокРабот;
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("Код", мСписокРабот);
		
		ОткрытьФорму("Справочник.бит_Работы.Форма.ФормаВыбораУправляемая", Новый Структура("ОткрытьИзДокументаУстановкаЦенРабот",  ПараметрыФормы), Элемент); 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНаРаботыЕдиницаИзмеренияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЦеныНаРаботы.ТекущиеДанные;
	
	Норма = ТекущаяСтрока.Норма;
	
	Если ЗначениеЗаполнено(Норма) Тогда
		
		Если ТекущаяСтрока.ЕдиницаИзмерения <> ПолучитьЕдиницуИзмеренияНормы(Норма) Тогда
			
			ТекущаяСтрока.Норма = Неопределено;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНаРаботыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мКэшЗначений.мСписокЕдиницИзмерения.Очистить();
	
	ТекущаяСтрока = Элементы.ЦеныНаРаботы.ТекущиеДанные;	
	Работа 		  = ТекущаяСтрока.Работа;
	
	Если ЗначениеЗаполнено(Работа) Тогда
		
		ПолучитьСписокЕдиницИзмеренияНаСервере(Работа);
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("Ссылка", мКэшЗначений.мСписокЕдиницИзмерения);
		
		ОткрытьФорму("Документ.бит_УстановкаСоставаРаботы.Форма.ФормаВыбораСправочникаКлассификаторЕдиницИзмерения", Новый Структура("ОткрытьИзДокументаУстановкаЦенРабот", ПараметрыФормы), Элемент);
		
	Иначе
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Заполните поле Работа.");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНаРаботыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		МассивЕдиницИзмерений = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресЕдиницИзмеренийВХранилище);
		
		Если МассивЕдиницИзмерений.Количество() > 0 Тогда
			
			ТекущаяСтрока = Элементы.ЦеныНаРаботы.ТекущиеДанные;
			
			// БИТ_ЖКХ 17.09.2014
			// ТекущаяСтрока.ЕдиницаИзмерения = МассивЕдиницИзмерений[0].Ссылка;.		
			ТекущаяСтрока.ЕдиницаИзмерения = МассивЕдиницИзмерений[0];	
			// БИТ_ЖКХ 17.09.2014
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНаРаботыНормаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЦеныНаРаботы.ТекущиеДанные;
	
	ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
	
	Если ПолучитьЕдиницуИзмеренияНормы(ТекущаяСтрока.Норма) <> ЕдиницаИзмерения Тогда
		
		ТекущаяСтрока.ЕдиницаИзмерения = ПолучитьЕдиницуИзмеренияНормы(ТекущаяСтрока.Норма);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНаРаботыНормаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ЦеныНаРаботы.ТекущиеДанные;
	
	Работа = ТекущаяСтрока.Работа;
	
	Если ЗначениеЗаполнено(Работа) Тогда
		
		ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
		
		Отбор = Новый Структура;
		
		Отбор.Вставить("Владелец", Работа);
		
		Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			
			Отбор.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
			
		КонецЕсли;
		
		ОткрытьФорму("Справочник.бит_НормыТруда.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);		
		
	Иначе
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Заполните поле Работа.");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта"  , Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Дата"                  , Объект.Дата);
	КэшированныеЗначения.Вставить("мПодразделение"        , Объект.Подразделение);
	
	мСписокЕдиницИзмерения = Новый СписокЗначений;
	мСписокРабот		   = Новый СписокЗначений;
	
	КэшированныеЗначения.Вставить("мСписокЕдиницИзмерения", мСписокЕдиницИзмерения);
	КэшированныеЗначения.Вставить("мСписокРабот",           мСписокРабот);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Процедура АктивизироватьРеквизитВФормеНаСервере(СтруктураРеквизитов)
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	бит_РаботаСДиалогамиСервер.АктивизироватьРеквизитВФорме(СправочникОбъект, ЭтаФорма, СтруктураРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьФормыДляРедактированияНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

// БИТ_ЖКХ 13.10.2011 Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

&НаСервере
Процедура ПолучитьСписокРаботНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_РаботыПодразделения.Ссылка.Код
	|ИЗ
	|	Справочник.бит_Работы.Подразделения КАК бит_РаботыПодразделения
	|ГДЕ
	|	бит_РаботыПодразделения.Подразделение.Ссылка = &Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_РаботыПодразделения.Ссылка.Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		мКэшЗначений.мСписокРабот.Добавить(Выборка.Код); 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокЕдиницИзмеренияНаСервере(Работа)
	
	Для Каждого ТекСтрока Из Работа.ЕдиницыИзмерения Цикл
		
		мКэшЗначений.мСписокЕдиницИзмерения.Добавить(ТекСтрока.ЕдиницаИзмерения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЕдиницуИзмеренияНормы(Норма)
	
	Возврат Норма.ЕдиницаИзмерения;
	
КонецФункции

&НаСервере
Функция ПолучитьВладельцаНормы(Норма)
	
	Возврат Норма.Владелец;
	
КонецФункции

#КонецОбласти
